package data_structure;

import java.time.LocalDate;
import java.time.format.DateTimeFormatter;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

/**
 * @program: arthmetic-basic-pro
 * @description:
 * @author: scl chongguanpeng coolcgp@163.com
 * @create: 2020-05-10 22:07
 **/
public class ProcessBirthday {

    static List<String> list = Arrays.asList(
        "1982年11月",
        "1982年4月",
        "1993年8月",
        "1987年4月",
        "1985年12月",
        "1981年12月",
        "1982年10月",
        "1978年10月",
        "1987年11月",
        "1990年2月",
        "1989年3月",
        "1977年12月",
        "1993年1月",
        "1985年9月",
        "1981年7月",
        "1982年3月",
        "1983.04.11",
        "1991.05.20",
        "1986.12.11",
        "1990.05.03",
        "1988.04.06",
        "1991.10.20",
        "1991.08.28",
        "1984.11.07",
        "1992.07.08",
        "1995.11.11",
        "1995.01.01",
        "1997.05.21",
        "1987.02.18",
        "1992.02.22",
        "1986.08.04",
        "1996.04.08",
        "1997.10.28",
        "1994.02.14",
        "1989.10.05",
        "1992.05.21",
        "1983.12.21",
        "1985.07.05",
        "1997.03.10",
        "1991.10.23",
        "1973.09.23",
        "1991.01.08",
        "1997.01.16",
        "1969年9月",
        "1971年10月",
        "1973年2月",
        "1994年2月",
        "1978年11月",
        "1983年1月",
        "1972年9月",
        "1989年6月",
        "1991年8月",
        "1988年1月",
        "1987年8月",
        "1979年6月",
        "1980年11月",
        "1985年10月",
        "1989年12月",
        "1992年1月",
        "1991年6月",
        "1992年6月",
        "1988年4月",
        "1984年12月",
        "1986年2月",
        "1975年1月",
        "1976年10月",
        "1990年9月",
        "1989年1月",
        "1982年12月",
        "1994年9月",
        "1979年1月",
        "1997.10.30",
        "1985.09.21",
        "1994.02.13",
        "1993.10.08",
        "1994.04.25",
        "1990.02.09",
        "1989.07.23",
        "1990.01.08",
        "1990.07.24",
        "1990.09.15",
        "1998.08.29",
        "1994.06.05",
        "1993.09.27",
        "1997.07.15",
        "1993.10.15",
        "1998.06.08",
        "1997.09.22",
        "1983.01.05",
        "1995.02.21",
        "1997.11.27",
        "1982.07.05",
        "1994.01.27",
        "1985.12.19",
        "1990.08.07",
        "1986.08.27",
        "1980.10.25",
        "1991.01.04",
        "1984.04.09",
        "1996.03.28",
        "1996.07.01",
        "1978年11月",
        "1988年10月",
        "1997年10月",
        "1996年1月",
        "1993年10月",
        "1986年6月",
        "1984年8月",
        "1998年8月",
        "1995年2月",
        "1994年4月",
        "1983年2月",
        "1987年10月",
        "1997年10月",
        "1990年4月",
        "1985年11月",
        "1988年4月",
        "1991年8月",
        "1995年8月",
        "1997年12月",
        "1994年9月",
        "1993年3月",
        "1994年10月",
        "1991年10月",
        "1992年6月",
        "1993年7月",
        "1989年3月",
        "1986年7月",
        "1990年9月",
        "1991年3月",
        "1986年10月",
        "1993年6月",
        "1992年2月",
        "1989年8月",
        "1996年7月",
        "1999年4月",
        "1985年10月",
        "1988年11月",
        "1996年8月",
        "1993年3月",
        "1998年8月",
        "1986年7月",
        "1972年12月",
        "1981年12月",
        "1990年12月",
        "1990年1月",
        "1992年9月",
        "1979年11月",
        "1982年4月",
        "1989年9月",
        "1973年9月",
        "1991年7月",
        "1982年9月",
        "1995.12.25",
        "1979.10.27",
        "1993.11.17",
        "1997.06.23",
        "1992.02.25",
        "1982.11.01",
        "1996.10.26",
        "1997.11.01",
        "1988.12.15",
        "1992.03.26",
        "1977.08.15",
        "1988.03.24",
        "1994.06.30",
        "1998.02.28",
        "1987.06.18",
        "1987.04.26",
        "1997.01.02",
        "1981.11.01",
        "1991.01.20",
        "1995.05.11",
        "1983年12月",
        "1985年7月",
        "1979年4月",
        "1982年11月",
        "1990年8月",
        "1992年3月",
        "1992年4月",
        "1976年9月",
        "1996年4月",
        "1998年11月",
        "1987年6月",
        "1995年12月",
        "1997年7月",
        "1997年2月",
        "1980.10.19",
        "1987.05.28",
        "1993.09.20",
        "1996.11.16",
        "1996.09.10",
        "1986.08.17",
        "1985.09.26",
        "1990.07.02",
        "1988.02.11",
        "1986.08.15",
        "1982.04.07",
        "1992.03.12",
        "1992.08.03",
        "1987.09.15",
        "1990.09.26",
        "1983.04.07",
        "1994.06.12",
        "1986.08.28",
        "1986.07.12",
        "1998.07.07",
        "1989.09.05",
        "1996.08.22",
        "1997.08.19",
        "1987.02.12",
        "1994.06.26",
        "1989.01.26",
        "1991.05.07",
        "1990.11.15",
        "1997.02.22",
        "1983.07.08",
        "1985.11.02",
        "1992.06.13",
        "1990.09.29",
        "1984.11.29",
        "1995.03.03",
        "1990.03.09",
        "1989.09.08",
        "1991年7月",
        "1982年6月",
        "1985年11月",
        "1990年11月",
        "1979年4月",
        "1980年2月",
        "1995年1月",
        "1993年4月",
        "1988年2月",
        "1991年12月",
        "1995年3月",
        "1983年12月",
        "1990年9月",
        "1985年10月",
        "1989年3月",
        "1997年10月",
        "1963年4月",
        "1993年8月",
        "1992年10月",
        "1995年9月",
        "1993年9月",
        "1989年1月",
        "1986年8月",
        "1988年1月"
    );
    static DateTimeFormatter yyyy年MM月 = DateTimeFormatter.ofPattern("yyyy年M月");
    static DateTimeFormatter yyyy年MM月hh日 = DateTimeFormatter.ofPattern("yyyy年M月d日");
    static DateTimeFormatter yyyyDotMM = DateTimeFormatter.ofPattern("yyyy.MM");
    static DateTimeFormatter yyyyDotMMDotdd = DateTimeFormatter.ofPattern("yyyy.MM.dd");

    public static LocalDate parse(String value, DateTimeFormatter dateTimeFormatter) {
        LocalDate rst = null;
        try {
            rst = LocalDate.parse(value, dateTimeFormatter);
        } catch (Exception e) {
        }
        return rst;
    }

    public static void main(String[] args) {

        int i = 0;
        for (String value : list) {
            if (value.contains("月") && !value.contains("日")) {
                value = value.replace("月", "月1日");
            }
            if (value.contains(".")) {
                String[] values = value.split("\\.");
                List<String> newValue = Arrays.stream(values).collect(Collectors.toList());
                if (values.length == 2) {
                    newValue.add("01");
                    value = String.join(".", newValue);
                } else if (values.length == 3) {
                    value = String.join(".", newValue);
                }
            }
            LocalDate localDate = null;
            if (parse(value, yyyy年MM月) != null) {
                localDate = parse(value, yyyy年MM月);
                i++;
            } else if (parse(value, yyyy年MM月hh日) != null) {
                localDate = parse(value, yyyy年MM月hh日);
                i++;
            } else if (parse(value, yyyyDotMM) != null) {
                localDate = parse(value, yyyyDotMM);
                i++;
            } else if (parse(value, yyyyDotMMDotdd) != null) {
                localDate = parse(value, yyyyDotMMDotdd);
                i++;
            } else {
                System.out.println("无法解析" + value);
            }
            System.out.println(localDate.getYear() + "年" + localDate.getMonthValue() + "月");
        }
        System.out.println("=========" + i);
    }

}
